### Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [19]:
!pip install sqlalchemy
!pip install pymysql

Requirement already satisfied: sqlalchemy in c:\users\hp\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: pymysql in c:\users\hp\anaconda3\lib\site-packages (1.0.2)

In [20]:
import pandas as pd
import sqlalchemy as alch

In [21]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password: ········

In [22]:
dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [23]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

### Check the number of rentals for each customer for May

In [24]:
rentalmay_df =pd.read_sql_query(
"""
SELECT * FROM rental_may;
""", engine
)
rentalmay_df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [45]:
query = "SELECT customer_id,  COUNT(rental_id) AS mayrentals FROM rental_may GROUP BY customer_id ORDER by COUNT(rental_id) DESC;"
nummay_df = pd.read_sql_query(query,engine)
nummay_df.head()

   customer_id  mayrentals
0          197           8
1           19           6
2          371           6
3          245           6
4          274           6

### Check the number of rentals for each customer for June

In [26]:
rentaljune_df =pd.read_sql_query(
"""
SELECT * FROM rental_june;
""", engine
)
rentaljune_df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [44]:
query = "SELECT customer_id, COUNT(rental_id) AS junerentals FROM rental_june GROUP BY customer_id ORDER by COUNT(rental_id) DESC;"
numjune_df = pd.read_sql_query(query,engine)
numjune_df.head()

   customer_id  junerentals
0           31           11
1          454           10
2          329            9
3          295            9
4          561            9

### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

### Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes.

In [28]:
len(nummay_df)

483

In [29]:
len(numjune_df)

590

In [46]:
new_df = nummay_df.merge(numjune_df, on="customer_id", how="inner")
new_df.head()

   customer_id  mayrentals  junerentals
0          197           8            8
1           19           6            3
2          371           6            7
3          245           6            3
4          274           6            2

In [51]:
new_df.isnull().sum().sum()

0

In [52]:
new_df

     customer_id  mayrentals  junerentals  rentaldiff   checking
0            197           8            8       False  No Change
1             19           6            3       False   Decrease
2            371           6            7        True   Increase
3            245           6            3       False   Decrease
4            274           6            2       False   Decrease
..           ...         ...          ...         ...        ...
471          262           1            4        True   Increase
472           11           1            3        True   Increase
473           12           1            6        True   Increase
474          123           1            5        True   Increase
475          513           1            3        True   Increase

[476 rows x 5 columns]

In [47]:
new_df['rentaldiff'] = new_df['mayrentals']< new_df['junerentals']
new_df.head()

   customer_id  mayrentals  junerentals  rentaldiff
0          197           8            8       False
1           19           6            3       False
2          371           6            7        True
3          245           6            3       False
4          274           6            2       False

In [48]:
new_df['checking'] = 0
new_df.head()

   customer_id  mayrentals  junerentals  rentaldiff  checking
0          197           8            8       False         0
1           19           6            3       False         0
2          371           6            7        True         0
3          245           6            3       False         0
4          274           6            2       False         0

In [60]:
new_df['checking'][new_df['mayrentals']<new_df['junerentals']] = 'Increase'
new_df['checking'][new_df['mayrentals']>new_df['junerentals']]= 'Decrease' 
new_df['checking'][new_df['mayrentals']== new_df['junerentals']]= 'No Change'

In [61]:
new_df.sample(10)

     customer_id  mayrentals  junerentals  rentaldiff  checking
87            54           3            4        True  Increase
303          230           1            6        True  Increase
175          297           2            5        True  Increase
299          459           1            7        True  Increase
463          137           1            4        True  Increase
202          571           2            6        True  Increase
266          110           2            1       False  Decrease
374          565           1            3        True  Increase
410          428           1            5        True  Increase
457          349           1            4        True  Increase